Tekla Open API Reference for Tekla Structures 2025
RebarMesh.LongitudinalDistances Property
 The longitudinal spacing double value(s).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList LongitudinalDistances { get; set; }
Public Property LongitudinalDistances As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace